{
  "backend/main.mo": "Defines the backend’s full data model including users, questions, attempts, results, chapters, categories, notifications, backups, and analytics event types.",
  "feature_evidence.json": "Lists implemented features with affected files, components, test IDs, and confidence metadata for build tracking.",
  "frontend-file-summaries.txt": "Provides short summaries of various frontend source files describing their purpose, UI roles, and behaviors.",
  "frontend/admin.html": "HTML entry point for the admin panel using dark theme, fonts, and loading the admin React bundle.",
  "frontend/docs/admin-api.md": "Documentation of admin API endpoints covering questions, content, users, notifications, analytics, feedback, and backup/restore.",
  "frontend/docs/deployment-troubleshooting.md": "Troubleshooting guide for deployment issues like the 'no draft' error with suggested clean deploy steps.",
  "frontend/docs/learner-tests-api.md": "Documents learner test APIs including chapter tests, exam mode, auth requirements, parameters, and examples.",
  "frontend/docs/navigation-map.md": "Describes the app’s hash-based routing structure, flows for practice and exam modes, and deep linking behavior.",
  "frontend/docs/postgres-ddl.md": "Reference PostgreSQL schema outlining tables and relationships mirroring the IC backend data model.",
  "frontend/docs/screen-mockups.md": "Provides wireframe-style descriptions of main app screens using the dark glassmorphic design system.",
  "frontend/index.css": "Tailwind-based global stylesheet defining theme variables, dark mode values, and base styling.",
  "frontend/index.html": "HTML entry point that loads fonts, sets metadata, and mounts the React app via main.tsx.",
  "frontend/src/admin/AdminApp.tsx": "Admin app root that checks Internet Identity and admin status before loading either the login screen or admin shell.",
  "frontend/src/admin/analytics/AnalyticsScreen.tsx": "Admin analytics UI allowing date filtering and displaying metrics and event data.",
  "frontend/src/admin/analytics/useAdminAnalytics.ts": "Hooks to fetch analytics events and compute derived metrics like users, app opens, and retention.",
  "frontend/src/admin/auth/AdminLoginScreen.tsx": "Admin login screen using Internet Identity with branded UI and loading states.",
  "frontend/src/admin/backup/BackupRestoreScreen.tsx": "UI for backing up and restoring system data with file upload, validation, and confirmation flow.",
  "frontend/src/admin/backup/backupValidation.ts": "Validates backup JSON structure by checking required fields and array formats.",
  "frontend/src/admin/backup/useBackupRestore.ts": "Hooks to trigger backup and restore operations via the actor API with toast feedback.",
  "frontend/src/admin/components/AdminShell.tsx": "Provides the main admin layout with header, sidebar navigation, and route-based content rendering along with logout handling.",
  "frontend/src/admin/components/EnglishText.ts": "Contains all static English text labels and messages used across the admin UI.",
  "frontend/src/admin/content/CategoriesTab.tsx": "Lists categories with create, edit, and delete actions and opens a form dialog for modifications.",
  "frontend/src/admin/content/CategoryFormDialog.tsx": "Dialog form for creating or editing a category using react-hook-form and category mutations.",
  "frontend/src/admin/content/ChapterFormDialog.tsx": "Dialog form for creating or editing chapters, including course selection and order input.",
  "frontend/src/admin/content/ChaptersCategoriesScreen.tsx": "Wrapper screen with tabs for managing chapters and categories.",
  "frontend/src/admin/content/ChaptersTab.tsx": "Displays the chapter list with add, edit, and delete actions and manages the chapter form dialog.",
  "frontend/src/admin/content/useChaptersCategories.ts": "Provides React Query hooks to list, create, update, and delete chapters and categories using the backend actor with cache invalidation and toast notifications.",
  "frontend/src/admin/feedback/feedbackExport.ts": "Exports feedback notifications to JSON or CSV by transforming data and triggering file downloads.",
  "frontend/src/admin/feedback/FeedbackInboxScreen.tsx": "Displays feedback messages, allows JSON/CSV export, and parses feedback fields for rendering.",
  "frontend/src/admin/main.tsx": "Bootstraps the admin app with React Query and Internet Identity provider.",
  "frontend/src/admin/notifications/NotificationsScreen.tsx": "Shows existing notifications and a form to compose and send new notifications to user segments.",
  "frontend/src/admin/notifications/useAdminNotifications.ts": "React Query hooks for listing and creating notifications with backend actor and toast feedback.",
  "frontend/src/admin/questions/BulkUploadQuestionsScreen.tsx": "Handles CSV template download, CSV upload/validation, and bulk question import via backend.",
  "frontend/src/admin/questions/csv/csvParsing.ts": "CSV parsing helpers that convert raw CSV text into row objects and normalize difficulty and answers.",
  "frontend/src/admin/questions/csv/validateQuestionRows.ts": "Validates parsed CSV rows, checking required fields, difficulty, and answer format, returning structured results.",
  "frontend/src/admin/questions/DeleteQuestionConfirmDialog.tsx": "Confirmation dialog for deleting a question using a mutation and showing loading states.",
  "frontend/src/admin/questions/QuestionFormDialog.tsx": "Modal form component for creating or editing questions, handling form state, mutations, and submission.",
  "frontend/src/admin/questions/QuestionsScreen.tsx": "Main questions management UI with filters, search, table display, and dialogs for create/edit/delete.",
  "frontend/src/admin/questions/types.ts": "Type definitions for question forms, filters, CSV rows, and validation results.",
  "frontend/src/admin/questions/useQuestionMutations.ts": "React Query hooks for searching, creating, updating, deleting, and bulk-uploading questions via backend actor.",
  "frontend/src/admin/routes.ts": "Defines admin route constants and human-readable labels for navigation.",
  "frontend/src/admin/users/usersCsvExport.ts": "Generates CSV data for a user's exam results and provides a helper to trigger CSV downloads.",
  "frontend/src/admin/users/UsersScreen.tsx": "UI for listing users, selecting a user, and viewing/exporting their exam history.",
  "frontend/src/admin/users/useUsersResults.ts": "React Query hooks to fetch users, user exam history, and export data from the backend actor.",
  "frontend/src/App.tsx": "Main app component handling splash, auth flow, profile setup, and route-based screen rendering inside an authenticated shell.",
  "frontend/src/components/auth/AuthFooter.tsx": "Shows contact links for support with phone and email icons.",
  "frontend/src/components/auth/CreateProfileForm.tsx": "Form for completing user profile with name, course, optional exam date, and validation.",
  "frontend/src/components/auth/OtpAuthFlow.tsx": "Handles OTP-based login flow including phone entry, OTP verification, and profile creation for new users.",
  "frontend/src/components/BrandHeader.tsx": "Renders a branded header with logo, unread notifications, and logout for authenticated users.",
  "frontend/src/components/GlassCard.tsx": "A reusable glass-style card wrapper applying visual effects and custom classes.",
  "frontend/src/components/layout/AuthenticatedShell.tsx": "Provides a background layout wrapper with animated gradients for authenticated pages.",
  "frontend/src/components/navigation/BottomNav.tsx": "Bottom navigation bar with route-based highlighting for home, tests, bookmarks, and profile.",
  "frontend/src/components/progress/AnimatedProgressBar.tsx": "Progress bar that animates value changes with a shimmer effect.",
  "frontend/src/components/reminders/InAppRemindersCard.tsx": "In-app card showing active reminder settings with dismiss functionality.",
  "frontend/src/components/SplashScreen.tsx": "Displays an animated splash screen with brand logo, gradients, and timed fade-out.",
  "frontend/src/components/stats/QuickStats.tsx": "Displays a Quick Stats card showing total tests, accuracy with progress bar, and weak chapter badges using placeholder data.",
  "frontend/src/config/brand.ts": "Defines centralized branding config including logo asset paths, name, tagline, and alt text.",
  "frontend/src/config/viral.ts": "Provides share, referral, and feature-flag configuration for viral and utility features.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useAnalytics.ts": "Offers functions to record analytics events when user consent and identity are available, plus an app-open event hook.",
  "frontend/src/hooks/useAnalyticsConsent.ts": "Manages user analytics consent via localStorage with grant and revoke helpers.",
  "frontend/src/hooks/useExamQueries.ts": "Contains React Query hooks for starting exams, fetching questions, submitting exams, and retrieving exam history and reviews.",
  "frontend/src/hooks/useFeedback.ts": "Provides hooks to submit feedback via notifications and fetch stored feedback entries.",
  "frontend/src/hooks/useHashRoute.ts": "Handles simple hash-based routing with state tracking and navigation helper.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook for managing login state, identities, and auth client setup.",
  "frontend/src/hooks/useLocalStreak.ts": "Tracks daily visit streaks using localStorage and updates streak based on last visit date.",
  "frontend/src/hooks/useNotifications.ts": "Fetches notifications from the backend actor using React Query.",
  "frontend/src/hooks/useOfflinePracticeSync.ts": "Syncs offline practice actions from local outbox to backend, retrying on reconnect and periodically.",
  "frontend/src/hooks/useOtpSession.ts": "Manages OTP auth session by storing token and phone in localStorage with login, logout, and error handling.",
  "frontend/src/hooks/usePracticeQueries.ts": "Provides React Query hooks for fetching questions, submitting answers, and managing bookmarks with offline caching.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query mutations and queries for OTP actions, saving profiles, and fetching the caller's user profile.",
  "frontend/src/hooks/useReferralCode.ts": "Generates a referral code based on the authenticated user's profile using a React Query hook.",
  "frontend/src/hooks/useReminderSettings.ts": "Stores and updates reminder-related settings in localStorage with utilities to modify banner state.",
  "frontend/src/hooks/useWebNotifications.ts": "Handles web notification permissions and provides functions to send test and reminder notifications.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables, utilities, gradients, shadows, and animations.",
  "frontend/src/main.tsx": "Initializes the React app with QueryClient and InternetIdentity providers.",
  "frontend/src/routes.ts": "Defines app route constants with paths, labels, descriptions, and legacy aliases.",
  "frontend/src/screens/BookmarksScreen.tsx": "Displays bookmarked questions with loading states and navigation to specific practice questions.",
  "frontend/src/screens/ChapterTestScreen.tsx": "Renders the chapter test intro screen with navigation and a start button.",
  "frontend/src/screens/CourseDashboard.tsx": "Dashboard showing user greeting, streak, quick stats, reminders, and navigation cards for major app features.",
  "frontend/src/screens/exam/ExamAttemptPanel.tsx": "Renders an exam question view with timer, navigation, answer selection, marking for review, and a submit confirmation dialog.",
  "frontend/src/screens/exam/ExamHistoryPanel.tsx": "Fetches and displays past exam attempts with stats, or shows placeholders when loading or empty.",
  "frontend/src/screens/exam/ExamResultsPanel.tsx": "Shows exam results with score, accuracy, time used, and weak chapter detection, plus actions for review, history, or starting a new exam.",
  "frontend/src/screens/exam/ExamReviewPanel.tsx": "Displays a detailed review of an exam attempt, including question outcomes, selected answers, and navigation back.",
  "frontend/src/screens/exam/ExamStartPanel.tsx": "Shows exam configuration, rules, and start/history actions based on the selected course.",
  "frontend/src/screens/exam/ExamTimerRing.tsx": "Implements a circular countdown timer with visual indicators for low and critical time states.",
  "frontend/src/screens/exam/useExamAttemptState.ts": "Provides state management for an ongoing exam attempt, including navigation, answers, review flags, and payload building.",
  "frontend/src/screens/ExamModeScreen.tsx": "Manages exam flow including starting exams, answering questions, submitting results, viewing history, and reviewing past attempts.",
  "frontend/src/screens/FeedbackScreen.tsx": "Provides a form for submitting app feedback with subject, message, and optional contact details.",
  "frontend/src/screens/NotificationsScreen.tsx": "Displays user notifications with loading, empty state, and timestamped notification cards.",
  "frontend/src/screens/PracticeModeScreen.tsx": "Implements chapter-based practice flow with question lists, answering, bookmarking, hints, and offline syncing.",
  "frontend/src/screens/ProfileScreen.tsx": "Shows user profile details and settings including notifications, reminders, analytics consent, and logout options.",
  "frontend/src/screens/ProgressScreen.tsx": "Displays a progress overview for predefined chapters with animated progress bars and a back-to-dashboard button.",
  "frontend/src/screens/ShareAppScreen.tsx": "Provides sharing options via WhatsApp, Web Share API, and clipboard, including referral-code sharing if available.",
  "frontend/src/screens/TestsScreen.tsx": "Shows test history header and a placeholder card when no tests are completed, with a button to start practicing.",
  "frontend/src/utils/phone.ts": "Contains utilities to validate and normalize phone numbers with basic formatting rules.",
  "frontend/src/utils/practiceCache.ts": "Manages localStorage caching for practice questions, bookmarks, and an offline outbox queue.",
  "frontend/src/utils/urlParams.ts": "Offers helpers for reading, storing, and persisting URL parameters across navigation using query strings and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind config enabling dark mode, custom colors, radii, shadows, and animation keyframes with typography, container-query, and animate plugins.",
  "project_state.json": "Project state describing full app and admin panel feature requirements, data models, flows, and known deployment issue."
}