{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Replace app logos with uploaded Swaraj Infotech assets and remove all Caffeine AI branding",
  "requirements": [
    {
      "id": "REQ-78",
      "summary": "Add newly uploaded logo assets and update learner app to use the new logo everywhere (including splash and header) with English alt text",
      "acceptanceCriteria": [
        "Both uploaded image files are committed under `frontend/public/assets/generated/` (either as-is or as converted/cropped derivatives), and are referenced directly from the UI (not via backend).",
        "`frontend/src/components/BrandHeader.tsx` no longer references the old logo path and displays the newly uploaded logo.",
        "`frontend/src/components/SplashScreen.tsx` no longer references the old logo path and displays the newly uploaded logo.",
        "No other learner-app screens show the previous logo asset anywhere (header areas, cards, empty states, etc.).",
        "All user-facing text related to the logo (e.g., alt text) is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/1770580116347.png",
          "operation": "create",
          "description": "Add the newly uploaded Swaraj Infotech logo image as a static frontend asset (do not route through backend)."
        },
        {
          "path": "frontend/public/assets/generated/1770580116347-1.png",
          "operation": "create",
          "description": "Add the newly uploaded Swaraj Infotech logo image variant as a static frontend asset (do not route through backend)."
        },
        {
          "path": "frontend/public/assets/generated/swaraj-infotech-logo.dim_1024x1024.png",
          "operation": "create",
          "description": "Ensure the required generated square logo image exists under this exact path and can be referenced by the UI as a static asset."
        },
        {
          "path": "frontend/public/assets/generated/swaraj-infotech-logo-poster.dim_1080x1920.png",
          "operation": "create",
          "description": "Ensure the required generated portrait poster image exists under this exact path and can be referenced by the UI as a static asset."
        },
        {
          "path": "frontend/src/config/brand.ts",
          "operation": "create",
          "description": "Create a centralized brand configuration (logo paths + English alt text) so the learner app can consistently reference the new logo assets from `frontend/public/assets/generated/`."
        },
        {
          "path": "frontend/src/components/BrandHeader.tsx",
          "operation": "modify",
          "description": "Update the header branding to use the new centralized brand logo path(s) and English alt text (remove any reference to the previous logo asset)."
        },
        {
          "path": "frontend/src/components/SplashScreen.tsx",
          "operation": "modify",
          "description": "Update the splash screen to use the new centralized brand logo path(s) and English alt text (remove any reference to the previous logo asset). Optionally reference `frontend/public/assets/generated/swaraj-infotech-logo-poster.dim_1080x1920.png` as a decorative/background image while keeping the primary logo as the uploaded asset."
        },
        {
          "path": "frontend/src/components/auth/OtpAuthFlow.tsx",
          "operation": "modify",
          "description": "Replace the login-flow logo usage with the new centralized brand logo path(s) and English alt text so the old logo no longer appears on the auth screen."
        }
      ]
    },
    {
      "id": "REQ-79",
      "summary": "Remove all Caffeine AI branding across learner app and Admin Panel while keeping Swaraj Infotech branding and English text",
      "acceptanceCriteria": [
        "A repo-wide search in the frontend codebase shows no remaining user-visible references to \"Caffeine\" or \"Caffeine AI\".",
        "Learner app UI contains no Caffeine/Caffeine AI branding in headers, footers, splash screen, login flow, dashboard, or settings/profile areas.",
        "Admin Panel UI contains no Caffeine/Caffeine AI branding in its login screen, shell/header/sidebar, or any admin screens.",
        "All user-facing text remains in English after removals."
      ],
      "file_operations": [
        {
          "path": "frontend/src/config/brand.ts",
          "operation": "modify",
          "description": "Add/confirm any brand name strings and reuse them across learner/admin UI to avoid lingering third-party branding in user-facing text."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Audit and remove/replace any user-visible \"Caffeine\" / \"Caffeine AI\" text that may appear in the learner app flow (including splash/authenticated shell transitions), keeping all user-facing text in English."
        },
        {
          "path": "frontend/src/components/auth/AuthFooter.tsx",
          "operation": "modify",
          "description": "Audit footer/help area for any Caffeine/Caffeine AI mentions and remove them if present, keeping the remaining support text in English."
        },
        {
          "path": "frontend/src/admin/components/AdminShell.tsx",
          "operation": "modify",
          "description": "Audit the Admin Panel shell (header/sidebar/footer areas) and remove any Caffeine/Caffeine AI branding if present; optionally swap the header icon block to display the centralized Swaraj Infotech logo from `frontend/public/assets/generated/` for consistent branding."
        },
        {
          "path": "frontend/src/admin/auth/AdminLoginScreen.tsx",
          "operation": "modify",
          "description": "Audit the Admin Panel login screen for any Caffeine/Caffeine AI mentions and remove them if present, keeping the remaining copy in English; optionally display the centralized Swaraj Infotech logo from `frontend/public/assets/generated/` for consistent branding."
        },
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Audit the learner app HTML shell for any Caffeine/Caffeine AI branding (e.g., title/meta) and remove/replace if present, keeping English text."
        },
        {
          "path": "frontend/admin.html",
          "operation": "modify",
          "description": "Audit the admin HTML shell for any Caffeine/Caffeine AI branding (e.g., title/meta) and remove/replace if present, keeping English text."
        }
      ]
    }
  ]
}